# -*- coding: utf-8 -*-
#+TITLE: PyCATSHOO modelling with COD3S - Simple block diagram example
#+AUTHOR: Roland Donat
#+EMAIL: roland.donat@edgemind.net
# #+DATE: 

# ==============================================
# Document Configuration
# ======================
# Orgmode
:CONFIG:
#+LANGUAGE: fr
#+OPTIONS: H:3 num:t toc:t \n:nil @:t ::t |:t ^:{} f:t TeX:t author:t d:nil timestamp:nil
#+OPTIONS: html-postamble:nil
#+STARTUP: content 
#+STARTUP: hidestars
#+DRAWERS: CONFIG OPTIONS CACHE MACROS
#+TODO: TODO(t) INPROGRESS(p) | DONE(d)
#+BIND: org-latex-table-scientific-notation "{%s}E{%s}"
# #+csl-style: ../ieee.csl
:END:

# HTML
# ----
:CONFIG:
# Org HTML Macros
#+MACRO: NEWLINE @@latex:\\@@ @@html:<br>@@
#+MACRO: HTMLFONTSIZE @@html:<font size="$2">$1</font>@@
#+MACRO: SUBTITLE @@html:<div class="slidesubtitle">$1</div>@@

# HTML options
# ------------
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://edgemind-sas.github.io/visual-identity/official_docs/css/edgemind.css" />
:END:

# Publishing configuration
:CONFIG:
#+BEGIN_SRC emacs-lisp :results silent :exports none :eval yes
(defun my-org-export-all ()
  "Export current Org file to HTML, Markdown and tangle code blocks."
  (interactive)
  ;; Export to HTML
  (org-html-export-to-html)
  ;; Export to Markdown
  (org-md-export-to-markdown)
  ;; Tangle the document (extract code blocks)
  (org-babel-tangle))

;; Vous pouvez lier cette fonction à une combinaison de touches si vous le souhaitez.
(global-set-key (kbd "C-c e a") 'my-org-export-all)
#+END_SRC
:END:


# ==============================================
# Document starts here
# ====================

# Configuration de l'environnement                           
# --------------------------------

#+NAME: python-imports
#+BEGIN_SRC python :exports none
import pandas as pd
import plotly.express as px
import plotly.graph_objects as go
import plotly.io as pio
** Upward movement

In this example, we configure our predictive model to predict upward future returns on a temporal horizon
of 15 time units forward:
#+BEGIN_SRC python :session :exports both :tangle dm2ml_tuto_01.py
import mosaic.predict_model as mpr

pm_up = mpr.PMLogit(
    returns_horizon=15,
    direction="up",
    threshold=0.00001,
    features=[indic_1, indic_2],
)
#+END_SRC

#+RESULTS:
The arguments of the =PMLogit= class are:
- =returns_horizon=: number of time units to consider for predicting future returns. The increase or
  decrease (depending on the =direction= argument) of future returns is the target variable of our
  model. 
- =direction=: indicates whether the model will predict an increase in future returns (="up"=) or a
  decrease (="down"=). 
- =threshold=: absolute variation threshold of returns indicating a future increase or decrease
  (depends on the =direction= parameter). 
- =features=: list of indicators to use as explanatory variables in the logistic regression. 

